back/app/controllers/videos_controller.rb

SELECT `videos`.* FROM `videos`
---
  def index
    @videos = Video.all

SELECT  `videos`.* FROM `videos` WHERE `videos`.`id` = 2 LIMIT 1
---
  def show
    @video = Video.find_by_id(params_video[:id])

SELECT  `videos`.* FROM `videos` WHERE `videos`.`id` = 3 LIMIT 1
UPDATE `videos` SET `plays` = 9, `updated_at` = '2016-11-24 18:22:58' WHERE `videos`.`id` = 3
---
  def update
    @video = Video.find_by_id(params_video[:id])
    puts params_video[:plays]
    if @video.update(params_video)